<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Str;

class Category_SubcategorySeeder extends Seeder
{
    public function run(): void
    {
        $data = [
            'Экскурсии' => [
                ['name' => 'Обзорные', 'description' => 'Увлекательные экскурсии, позволяющие познакомиться с городом или регионом с самых лучших ракурсов.'],
                ['name' => 'Музеи и галереи', 'description' => 'Визиты в культурные заведения, где можно наслаждаться искусством и историей.'],
                ['name' => 'Архитектура и парки', 'description' => 'Прогулки по архитектурным шедеврам и живописным паркам, изучая историческое наследие.'],
                ['name' => 'Религиозные места', 'description' => 'Посещения храмов, соборов и святых мест, которые рассказывают о культуре и верованиях региона.'],
                ['name' => 'Шопинг-туры', 'description' => 'Выездные экскурсии с акцентом на шопинг, где можно найти уникальные местные товары.'],
                ['name' => 'Квесты и игры', 'description' => 'Интерактивные путешествия, где участники решают загадки и выполняют задания в поисках приключений.'],
                ['name' => 'Мифы и легенды', 'description' => 'Экскурсии, исследующие местные легенды и мифические существа, погружающие в атмосферу сказок.'],
                ['name' => 'Фольклорные места', 'description' => 'Путешествия по местам, связанным с народными традициями и культурным наследием.'],
            ],
            'Природа и активный отдых' => [
                ['name' => 'Походы и трекинг', 'description' => 'Активные приключения по живописным маршрутам с контактами с природой.'],
                ['name' => 'Фитнес-туризм', 'description' => 'Сочетание активного отдыха и фитнес-занятий для улучшения здоровья и физической формы.'],
                ['name' => 'Сафари и наблюдение за природой', 'description' => 'Экспедиции в дикие уголки для наблюдения за животными в их естественной среде обитания.'],
                ['name' => 'Конные прогулки', 'description' => 'Приятные поездки на лошадях по живописным тропам и ландшафтам.'],
                ['name' => 'Авто-прогулки', 'description' => 'Путешествия на автомобилях по живописным маршрутам и национальным паркам.'],
                ['name' => 'Воздушные прогулки', 'description' => 'Полеты на воздушных шарах или парапланах для захватывающих видов с высоты.'],
                ['name' => 'Ботанические экскурсии', 'description' => 'Изучение растительности региона с акцентом на уникальные растения и экосистемы.'],
                ['name' => 'Рыболовные туры', 'description' => 'Увлекательные выезды на рыбалку с возможностью поймать редкие виды рыб.'],
            ],
            'Спорт и экстрим' => [
                ['name' => 'Мото-туры', 'description' => 'Путешествия на мотоциклах по живописным маршрутам для настоящих любителей скорости.'],
                ['name' => 'Велотуры и велопоходы', 'description' => 'Активный отдых на велосипедах вдоль живописных маршрутов.'],
                ['name' => 'Фрирайд', 'description' => 'Адреналиновое катание на лыжах и сноуборде вне подготовленных трасс.'],
                ['name' => 'Горные лыжи', 'description' => 'Спорт в горах с возможностью насладиться великолепными снежными склонами.'],
                ['name' => 'Сноубординг', 'description' => 'Зимние радости на доске, катаясь по снегу, как для новичков, так и для профессионалов.'],
                ['name' => 'Ски-туринг', 'description' => 'Горные походы с лыжами в экзотических местах для опытных туристов.'],
                ['name' => 'Заброски на снегоходах', 'description' => 'Увлекательные приключения по заснеженным местам на снегоходах.'],
                ['name' => 'Заброски на вертолетах', 'description' => 'Путешествия по отдаленным местам с помощью вертолета, доступные лишь единицам.'],
                ['name' => 'Серфинг', 'description' => 'Спорт на воде, который привлекает искателей волн и адреналина.'],
                ['name' => 'Каякинг', 'description' => 'Сплавы по рекам и озерам на каяках, обеспечивающие уединение в природе.'],
                ['name' => 'Дайвинг', 'description' => 'Погружение под воду для изучения подводного мира.'],
                ['name' => 'Рафтинг', 'description' => 'Водные приключения по бурным рекам на плоту.'],
                ['name' => 'Парусные гонки (регата)', 'description' => 'Турниры на парусниках, где тестируется мастерство управления.'],
                ['name' => 'Яхтинг', 'description' => 'Приятные прогулки на яхтах вдоль побережий или по спокойным водоемам.'],
                ['name' => 'Трекинг', 'description' => 'Пешие походы по сложным маршрутам для истинных искателей приключений.'],
                ['name' => 'Банджи-джампинг', 'description' => 'Прыжки с высоты для любителей острых ощущений.'],
                ['name' => 'Парапланеризм', 'description' => 'Полеты на парапланах, дарящие свободу и непередаваемые эмоции.'],
                ['name' => 'Альпинизм', 'description' => 'Восхождения на вершины гор для искушенных любителей высоты.'],
                ['name' => 'Скалолазание', 'description' => 'Испытание своего мастерства на природных или искусственных стенах.'],
                ['name' => 'Джип-туры', 'description' => 'Приключения на внедорожниках по сложным маршрутам оставят незабываемые воспоминания.'],
                ['name' => 'Авто-туры', 'description' => 'Путешествия на автомобилях по интересным местам с посещением достопримечательностей.'],
            ],
            'Гастрономия и напитки' => [
                ['name' => 'Кулинарные мастер-классы', 'description' => 'Занятия, где вы научитесь готовить местные блюда под руководством шеф-поваров.'],
                ['name' => 'Гастрономические туры', 'description' => 'Погружение в кулинарные традиции региона с дегустацией местных деликатесов.'],
                ['name' => 'Винные туры и дегустации', 'description' => 'Изучение винодельческих регионов с возможностью дегустации уникальных вин.'],
                ['name' => 'Эко-фермы', 'description' => 'Визиты на фермы, производящие натуральные продукты и предлагающие эко-опыты.'],
                ['name' => 'Гастрономические ужины', 'description' => 'Уникальные ужины в ресторанах с авторскими блюдами и необычной подачей.'],
            ],
            'Искусство и творчество' => [
                ['name' => 'Арт-фестивали и мастер-классы', 'description' => 'Мероприятия, на которых вы сможете проявить себя и познакомиться с искусством.'],
                ['name' => 'Фототуры', 'description' => 'Уникальные путешествия для любителей фотографии с возможностью запечатлеть живописные места.'],
                ['name' => 'Кинотеатры на открытом воздухе', 'description' => 'Показ фильмов под звездами на свежем воздухе для романтической атмосферы.'],
                ['name' => 'Танцевальные мастер-классы', 'description' => 'Уроки танцев различных стилей, где вы сможете освоить новые движения.'],
                ['name' => 'Тематические вечеринки', 'description' => 'Развлекательные мероприятия на заданные темы, чтобы повеселиться с друзьями.'],
                ['name' => 'Литературные вечера', 'description' => 'Вечера, посвященные литературе, поэзии и выступлениям авторов.'],
                ['name' => 'Выставки и арт-галереи', 'description' => 'Посещения культурных мероприятий, где представлены работы местных и зарубежных художников.'],
            ],
            'Наука и образование' => [
                ['name' => 'Астрономия', 'description' => 'Мероприятия, посвященные звездам и планетам, с наблюдениями через телескопы.'],
                ['name' => 'Образовательные программы', 'description' => 'Тренинги и курсы по различным темам для повышения квалификации и знаний.'],
                ['name' => 'Индустриальный туризм', 'description' => 'Экскурсии на заводы и предприятия, знакомящие с процессом производства.'],
                ['name' => 'Ремесленные мастерские', 'description' => 'Участие в создании ручных изделий и погружение в традиционные ремесла.'],
                ['name' => 'Научные выставки', 'description' => 'Выставки, где можно узнать о современных научных достижениях и открытиях.'],
                ['name' => 'Робототехника', 'description' => 'Мероприятия, посвященные разработке и созданию роботов, научные выставки по тематике.'],
                ['name' => 'Мастер-классы', 'description' => 'Уроки, где участники смогут освоить новое и научиться чему-то интересному.'],
            ],
            'Релаксация и велнес' => [
                ['name' => 'Ретриты', 'description' => 'Уединенные мероприятия для восстановления эмоционального и духовного баланса.'],
                ['name' => 'Велнес и СПА', 'description' => 'Программы для заботы о здоровье, включающие массажи и процедуры для тела и души.'],
                ['name' => 'Антистресс-туризм', 'description' => 'Поездки, которые помогут расслабиться и избавить от стресса.'],
                ['name' => 'Духовные практики', 'description' => 'Мероприятия, направленные на осознание, медитацию и внутренний покой.'],
                ['name' => 'Медитация и осознанность', 'description' => 'Практики, способствующие внутреннему умиротворению и концентрации на настоящем.'],
                ['name' => 'Здоровое питание', 'description' => 'Обучение основам здорового питания и приготовлению полезных блюд.'],
                ['name' => 'Девичники', 'description' => 'Специально организованные мероприятия для девушек для отдыха и развлечений.'],
            ],
            'Бизнес и профессии' => [
                ['name' => 'Бизнес-ивенты', 'description' => 'Мероприятия, посвященные современным тенденциям в бизнесе и экономике.'],
                ['name' => 'Тренинги и семинары', 'description' => 'Обучающие мероприятия для профессионалов различных сфер.'],
                ['name' => 'Мероприятия по профессиям', 'description' => 'Встречи с практиками, которые делятся опытом и знаниями в своей области.'],
                ['name' => 'Нетворкинг', 'description' => 'События для обмена контактами, знакомства и налаживания связей.'],
                ['name' => 'Бизнес-завтраки', 'description' => 'Утренние мероприятия, где участники могут пообщаться и обсудить актуальные вопросы.'],
                ['name' => 'Коучинг', 'description' => 'Персональные тренинги и консультации для личностного роста и профессионального развития.'],
            ],
            'Психология и личностный рост' => [
                ['name' => 'Развитие личности', 'description' => 'Мероприятия, направленные на саморазвитие и самосовершенствование.'],
                ['name' => 'Социальные навыки', 'description' => 'Тренинги, помогающие улучшить коммуникацию и взаимодействие с окружающими.'],
                ['name' => 'Коммуникации', 'description' => 'Курсы и семинары по эффективному общению и установлению контактов.'],
                ['name' => 'Лидерство', 'description' => 'Обучение эффективным лидерским качествам и навыкам управления командой.'],
                ['name' => 'Ораторское мастерство', 'description' => 'Тренинги, помогающие развить навыки публичных выступлений и уверенности.'],
                ['name' => 'Творческое развитие', 'description' => 'Мероприятия, способствующие раскрытию творческого потенциала.'],
                ['name' => 'Самодисциплина', 'description' => 'Уроки, помогающие выстраивать свои привычки и достигать поставленных целей.'],
                ['name' => 'Тайм-менеджмент', 'description' => 'Классы, обучающие эффективному планированию времени и приоритетов.'],
                ['name' => 'Психологические игры', 'description' => 'Игры и упражнения, помогающие раскрыть внутренний мир и научиться работать в команде.'],
                ['name' => 'Мастер-классы', 'description' => 'Специальные занятия для получения новых навыков и знаний.'],
            ],
            'Экологические и социальные инициативы' => [
                ['name' => 'Волонтерские программы', 'description' => 'Программы, направленные на помощь обществу и окружающей среде, где участники могут внести свой вклад.'],
                ['name' => 'Социальные проекты', 'description' => 'Инициативы, направленные на улучшение жизни сообщества и решение социальных проблем.'],
                ['name' => 'Экологические инициативы', 'description' => 'Проекты, направленные на защиту окружающей среды и устойчивое развитие.'],
            ],
        ];

        foreach ($data as $categoryName => $subcategories) {

            $iconSvg = match ($categoryName) {
                'Природа и активный отдых' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.7498 5.25C14.8498 5.25 15.7498 4.35 15.7498 3.25C15.7498 2.15 14.8498 1.25 13.7498 1.25C12.6498 1.25 11.7498 2.15 11.7498 3.25C11.7498 4.35 12.6498 5.25 13.7498 5.25ZM17.7498 10.53C16.5198 10.16 15.5298 9.36 14.9498 8.35L13.9498 6.75C13.5398 6.1 12.8398 5.75 12.1098 5.75C11.3298 5.75 10.5198 6.25 10.3298 7.19C10.1398 8.13 7.2498 22.75 7.2498 22.75H9.3498L11.1498 14.75L13.2498 16.75V22.75H15.2498V15.25L13.1498 13.25L13.7498 10.25C14.7498 11.4 16.1598 12.26 17.7498 12.59V22.75H19.2498V8.75H17.7498V10.53ZM7.6798 12.88L5.5598 12.47C5.0198 12.36 4.6598 11.84 4.7698 11.3L5.5298 7.37C5.7398 6.29 6.7898 5.58 7.8698 5.79L9.0298 6.02L7.6798 12.88Z" fill="#202127"/></svg>',

                'Гастрономия и напитки' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M7.79945 13.1283L10.6295 10.2983L3.60945 3.28829C2.04945 4.84829 2.04945 7.37829 3.60945 8.94829L7.79945 13.1283ZM14.5795 11.3183C16.1095 12.0283 18.2595 11.5283 19.8495 9.93829C21.7595 8.02829 22.1295 5.28829 20.6595 3.81829C19.1995 2.35829 16.4595 2.71829 14.5395 4.62829C12.9495 6.21829 12.4495 8.36829 13.1595 9.89829L3.39945 19.6583L4.80945 21.0683L11.6995 14.1983L18.5795 21.0783L19.9895 19.6683L13.1095 12.7883L14.5795 11.3183Z" fill="#202127"/>
</svg>',
                'Искусство и творчество' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M12 22C10.6333 22 9.34167 21.7375 8.125 21.2125C6.90833 20.6875 5.84583 19.9708 4.9375 19.0625C4.02917 18.1542 3.3125 17.0917 2.7875 15.875C2.2625 14.6583 2 13.3667 2 12C2 10.6167 2.27083 9.31667 2.8125 8.1C3.35417 6.88333 4.0875 5.825 5.0125 4.925C5.9375 4.025 7.01667 3.3125 8.25 2.7875C9.48333 2.2625 10.8 2 12.2 2C13.5333 2 14.7917 2.22917 15.975 2.6875C17.1583 3.14583 18.1958 3.77917 19.0875 4.5875C19.9792 5.39583 20.6875 6.35417 21.2125 7.4625C21.7375 8.57083 22 9.76667 22 11.05C22 12.9667 21.4167 14.4375 20.25 15.4625C19.0833 16.4875 17.6667 17 16 17H14.15C14 17 13.8958 17.0417 13.8375 17.125C13.7792 17.2083 13.75 17.3 13.75 17.4C13.75 17.6 13.875 17.8875 14.125 18.2625C14.375 18.6375 14.5 19.0667 14.5 19.55C14.5 20.3833 14.2708 21 13.8125 21.4C13.3542 21.8 12.75 22 12 22ZM6.5 13C6.93333 13 7.29167 12.8583 7.575 12.575C7.85833 12.2917 8 11.9333 8 11.5C8 11.0667 7.85833 10.7083 7.575 10.425C7.29167 10.1417 6.93333 10 6.5 10C6.06667 10 5.70833 10.1417 5.425 10.425C5.14167 10.7083 5 11.0667 5 11.5C5 11.9333 5.14167 12.2917 5.425 12.575C5.70833 12.8583 6.06667 13 6.5 13ZM9.5 9C9.93333 9 10.2917 8.85833 10.575 8.575C10.8583 8.29167 11 7.93333 11 7.5C11 7.06667 10.8583 6.70833 10.575 6.425C10.2917 6.14167 9.93333 6 9.5 6C9.06667 6 8.70833 6.14167 8.425 6.425C8.14167 6.70833 8 7.06667 8 7.5C8 7.93333 8.14167 8.29167 8.425 8.575C8.70833 8.85833 9.06667 9 9.5 9ZM14.5 9C14.9333 9 15.2917 8.85833 15.575 8.575C15.8583 8.29167 16 7.93333 16 7.5C16 7.06667 15.8583 6.70833 15.575 6.425C15.2917 6.14167 14.9333 6 14.5 6C14.0667 6 13.7083 6.14167 13.425 6.425C13.1417 6.70833 13 7.06667 13 7.5C13 7.93333 13.1417 8.29167 13.425 8.575C13.7083 8.85833 14.0667 9 14.5 9ZM17.5 13C17.9333 13 18.2917 12.8583 18.575 12.575C18.8583 12.2917 19 11.9333 19 11.5C19 11.0667 18.8583 10.7083 18.575 10.425C18.2917 10.1417 17.9333 10 17.5 10C17.0667 10 16.7083 10.1417 16.425 10.425C16.1417 10.7083 16 11.0667 16 11.5C16 11.9333 16.1417 12.2917 16.425 12.575C16.7083 12.8583 17.0667 13 17.5 13ZM12 20C12.15 20 12.2708 19.9583 12.3625 19.875C12.4542 19.7917 12.5 19.6833 12.5 19.55C12.5 19.3167 12.375 19.0417 12.125 18.725C11.875 18.4083 11.75 17.9333 11.75 17.3C11.75 16.6 11.9917 16.0417 12.475 15.625C12.9583 15.2083 13.55 15 14.25 15H16C17.1 15 18.0417 14.6792 18.825 14.0375C19.6083 13.3958 20 12.4 20 11.05C20 9.03333 19.2292 7.35417 17.6875 6.0125C16.1458 4.67083 14.3167 4 12.2 4C9.93333 4 8 4.775 6.4 6.325C4.8 7.875 4 9.76667 4 12C4 14.2167 4.77917 16.1042 6.3375 17.6625C7.89583 19.2208 9.78333 20 12 20Z" fill="#202127"/>
</svg>',
                'Экскурсии' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M1 21V9H3V11H5V3H7V5H9V3H11V5H13V3H15V5H17V3H19V11H21V9H23V21H14V18C14 17.45 13.8042 16.9792 13.4125 16.5875C13.0208 16.1958 12.55 16 12 16C11.45 16 10.9792 16.1958 10.5875 16.5875C10.1958 16.9792 10 17.45 10 18V21H1ZM3 19H8V18C8 16.9 8.39167 15.9583 9.175 15.175C9.95833 14.3917 10.9 14 12 14C13.1 14 14.0417 14.3917 14.825 15.175C15.6083 15.9583 16 16.9 16 18V19H21V13H17V7H7V13H3V19ZM9 12H11V9H9V12ZM13 12H15V9H13V12Z" fill="#202127"/>
</svg>',
                'Спорт и экстрим' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M5 22C3.61667 22 2.4375 21.5125 1.4625 20.5375C0.4875 19.5625 0 18.3833 0 17C0 15.6167 0.4875 14.4375 1.4625 13.4625C2.4375 12.4875 3.61667 12 5 12C6.38333 12 7.5625 12.4875 8.5375 13.4625C9.5125 14.4375 10 15.6167 10 17C10 18.3833 9.5125 19.5625 8.5375 20.5375C7.5625 21.5125 6.38333 22 5 22ZM5 20C5.83333 20 6.54167 19.7083 7.125 19.125C7.70833 18.5417 8 17.8333 8 17C8 16.1667 7.70833 15.4583 7.125 14.875C6.54167 14.2917 5.83333 14 5 14C4.16667 14 3.45833 14.2917 2.875 14.875C2.29167 15.4583 2 16.1667 2 17C2 17.8333 2.29167 18.5417 2.875 19.125C3.45833 19.7083 4.16667 20 5 20ZM11 19V14L7.8 11.2C7.6 11.0167 7.45 10.8042 7.35 10.5625C7.25 10.3208 7.2 10.0667 7.2 9.8C7.2 9.53333 7.25417 9.27917 7.3625 9.0375C7.47083 8.79583 7.61667 8.58333 7.8 8.4L10.6 5.6C10.8 5.4 11.0292 5.25 11.2875 5.15C11.5458 5.05 11.8167 5 12.1 5C12.3833 5 12.6542 5.05 12.9125 5.15C13.1708 5.25 13.4 5.4 13.6 5.6L15.5 7.5C15.9667 7.96667 16.5 8.33333 17.1 8.6C17.7 8.86667 18.3333 9 19 9V11C18.05 11 17.1458 10.8167 16.2875 10.45C15.4292 10.0833 14.6667 9.56667 14 8.9L13.2 8.1L10.8 10.5L13 12.8V19H11ZM15.5 5.5C14.95 5.5 14.4792 5.30417 14.0875 4.9125C13.6958 4.52083 13.5 4.05 13.5 3.5C13.5 2.95 13.6958 2.47917 14.0875 2.0875C14.4792 1.69583 14.95 1.5 15.5 1.5C16.05 1.5 16.5208 1.69583 16.9125 2.0875C17.3042 2.47917 17.5 2.95 17.5 3.5C17.5 4.05 17.3042 4.52083 16.9125 4.9125C16.5208 5.30417 16.05 5.5 15.5 5.5ZM19 22C17.6167 22 16.4375 21.5125 15.4625 20.5375C14.4875 19.5625 14 18.3833 14 17C14 15.6167 14.4875 14.4375 15.4625 13.4625C16.4375 12.4875 17.6167 12 19 12C20.3833 12 21.5625 12.4875 22.5375 13.4625C23.5125 14.4375 24 15.6167 24 17C24 18.3833 23.5125 19.5625 22.5375 20.5375C21.5625 21.5125 20.3833 22 19 22ZM19 20C19.8333 20 20.5417 19.7083 21.125 19.125C21.7083 18.5417 22 17.8333 22 17C22 16.1667 21.7083 15.4583 21.125 14.875C20.5417 14.2917 19.8333 14 19 14C18.1667 14 17.4583 14.2917 16.875 14.875C16.2917 15.4583 16 16.1667 16 17C16 17.8333 16.2917 18.5417 16.875 19.125C17.4583 19.7083 18.1667 20 19 20Z" fill="#202127"/>
</svg>',

                'Экологические и социальные инициативы' => '
<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M9.2 9.2L11.425 5.525L9.95 3.075C9.75 2.74167 9.4625 2.575 9.0875 2.575C8.7125 2.575 8.425 2.74167 8.225 3.075L5.775 7.15L9.2 9.2ZM18.875 16L16.65 12.3L20.125 10.3L21.725 12.975C21.9083 13.2583 22.0083 13.575 22.025 13.925C22.0417 14.275 21.9667 14.6 21.8 14.9C21.6333 15.2333 21.3875 15.5 21.0625 15.7C20.7375 15.9 20.3833 16 20 16H18.875ZM16 23L12 19L16 15V17H20.75L19.3 19.9C19.1167 20.2333 18.8667 20.5 18.55 20.7C18.2333 20.9 17.8833 21 17.5 21H16V23ZM6.325 21C5.99167 21 5.6875 20.9125 5.4125 20.7375C5.1375 20.5625 4.93333 20.3333 4.8 20.05C4.66667 19.7833 4.60417 19.5042 4.6125 19.2125C4.62083 18.9208 4.7 18.65 4.85 18.4L5.7 17H10V21H6.325ZM3.85 18.15L2.225 14.9C2.075 14.6 2.00417 14.2792 2.0125 13.9375C2.02083 13.5958 2.11667 13.275 2.3 12.975L2.7 12.3L1 11.275L6.475 9.9L7.85 15.4L6.125 14.35L3.85 18.15ZM17.35 9.6L11.875 8.225L13.6 7.2L10.475 2H14C14.35 2 14.6792 2.0875 14.9875 2.2625C15.2958 2.4375 15.5417 2.675 15.725 2.975L17.025 5.15L18.725 4.1L17.35 9.6Z" fill="#202127"/>
</svg>',
                'Психология и личностный рост' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M6 22V17.7C5.05 16.8333 4.3125 15.8208 3.7875 14.6625C3.2625 13.5042 3 12.2833 3 11C3 8.5 3.875 6.375 5.625 4.625C7.375 2.875 9.5 2 12 2C14.0833 2 15.9292 2.6125 17.5375 3.8375C19.1458 5.0625 20.1917 6.65833 20.675 8.625L21.975 13.75C22.0583 14.0667 22 14.3542 21.8 14.6125C21.6 14.8708 21.3333 15 21 15H19V18C19 18.55 18.8042 19.0208 18.4125 19.4125C18.0208 19.8042 17.55 20 17 20H15V22H13V18H17V13H19.7L18.75 9.125C18.3667 7.60833 17.55 6.375 16.3 5.425C15.05 4.475 13.6167 4 12 4C10.0667 4 8.41667 4.675 7.05 6.025C5.68333 7.375 5 9.01667 5 10.95C5 11.95 5.20417 12.9 5.6125 13.8C6.02083 14.7 6.6 15.5 7.35 16.2L8 16.8V22H6ZM12 16C12.2833 16 12.5208 15.9042 12.7125 15.7125C12.9042 15.5208 13 15.2833 13 15C13 14.7167 12.9042 14.4792 12.7125 14.2875C12.5208 14.0958 12.2833 14 12 14C11.7167 14 11.4792 14.0958 11.2875 14.2875C11.0958 14.4792 11 14.7167 11 15C11 15.2833 11.0958 15.5208 11.2875 15.7125C11.4792 15.9042 11.7167 16 12 16ZM11.25 12.8H12.775C12.775 12.3833 12.8292 12.0458 12.9375 11.7875C13.0458 11.5292 13.2667 11.2167 13.6 10.85C13.9 10.5167 14.1917 10.1792 14.475 9.8375C14.7583 9.49583 14.9 9.05 14.9 8.5C14.9 7.8 14.6292 7.20833 14.0875 6.725C13.5458 6.24167 12.875 6 12.075 6C11.4083 6 10.8042 6.19167 10.2625 6.575C9.72083 6.95833 9.34167 7.45833 9.125 8.075L10.5 8.65C10.6167 8.28333 10.8208 7.9875 11.1125 7.7625C11.4042 7.5375 11.725 7.425 12.075 7.425C12.4417 7.425 12.7458 7.525 12.9875 7.725C13.2292 7.925 13.35 8.18333 13.35 8.5C13.35 8.85 13.2458 9.1625 13.0375 9.4375C12.8292 9.7125 12.5833 9.99167 12.3 10.275C11.9667 10.625 11.7083 10.975 11.525 11.325C11.3417 11.675 11.25 12.1667 11.25 12.8Z" fill="#202127"/>
</svg>',
                'Лечебный туризм' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M10.5 15.5H13.5V13H16V10H13.5V7.5H10.5V10H8V13H10.5V15.5ZM12 22C9.68333 21.4167 7.77083 20.0875 6.2625 18.0125C4.75417 15.9375 4 13.6333 4 11.1V5L12 2L20 5V11.1C20 13.6333 19.2458 15.9375 17.7375 18.0125C16.2292 20.0875 14.3167 21.4167 12 22ZM12 19.9C13.7333 19.35 15.1667 18.25 16.3 16.6C17.4333 14.95 18 13.1167 18 11.1V6.375L12 4.125L6 6.375V11.1C6 13.1167 6.56667 14.95 7.7 16.6C8.83333 18.25 10.2667 19.35 12 19.9Z" fill="#202127"/>
</svg>',
                'Специальные туры "Семья"' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M18 6C17.45 6 16.9792 5.80417 16.5875 5.4125C16.1958 5.02083 16 4.55 16 4C16 3.45 16.1958 2.97917 16.5875 2.5875C16.9792 2.19583 17.45 2 18 2C18.55 2 19.0208 2.19583 19.4125 2.5875C19.8042 2.97917 20 3.45 20 4C20 4.55 19.8042 5.02083 19.4125 5.4125C19.0208 5.80417 18.55 6 18 6ZM17 22V14C17 13.3333 16.8292 12.7333 16.4875 12.2C16.1458 11.6667 15.7083 11.25 15.175 10.95L16.05 8.375C16.1833 7.95833 16.4292 7.625 16.7875 7.375C17.1458 7.125 17.55 7 18 7C18.45 7 18.8542 7.125 19.2125 7.375C19.5708 7.625 19.8167 7.95833 19.95 8.375L22.5 16H20V22H17ZM12.5 11.5C12.0833 11.5 11.7292 11.3542 11.4375 11.0625C11.1458 10.7708 11 10.4167 11 10C11 9.58333 11.1458 9.22917 11.4375 8.9375C11.7292 8.64583 12.0833 8.5 12.5 8.5C12.9167 8.5 13.2708 8.64583 13.5625 8.9375C13.8542 9.22917 14 9.58333 14 10C14 10.4167 13.8542 10.7708 13.5625 11.0625C13.2708 11.3542 12.9167 11.5 12.5 11.5ZM5.5 6C4.95 6 4.47917 5.80417 4.0875 5.4125C3.69583 5.02083 3.5 4.55 3.5 4C3.5 3.45 3.69583 2.97917 4.0875 2.5875C4.47917 2.19583 4.95 2 5.5 2C6.05 2 6.52083 2.19583 6.9125 2.5875C7.30417 2.97917 7.5 3.45 7.5 4C7.5 4.55 7.30417 5.02083 6.9125 5.4125C6.52083 5.80417 6.05 6 5.5 6ZM3.5 22V15H2V9C2 8.45 2.19583 7.97917 2.5875 7.5875C2.97917 7.19583 3.45 7 4 7H7C7.55 7 8.02083 7.19583 8.4125 7.5875C8.80417 7.97917 9 8.45 9 9V15H7.5V22H3.5ZM11 22V18H10V14C10 13.5833 10.1458 13.2292 10.4375 12.9375C10.7292 12.6458 11.0833 12.5 11.5 12.5H13.5C13.9167 12.5 14.2708 12.6458 14.5625 12.9375C14.8542 13.2292 15 13.5833 15 14V18H14V22H11Z" fill="#202127"/>
</svg>',
                'Музыка и развлечения' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M14.1059 19.4999C13.1434 19.4999 12.3195 19.1572 11.6341 18.4717C10.9486 17.7864 10.6059 16.9624 10.6059 15.9999C10.6059 15.0374 10.9486 14.2135 11.6341 13.5282C12.3195 12.8427 13.1434 12.4999 14.1059 12.4999C14.4892 12.4999 14.8482 12.557 15.1829 12.6712C15.5176 12.7852 15.8252 12.9564 16.1059 13.1847V4.34619H21.5481V6.99994H17.6059V15.9999C17.6059 16.9624 17.2632 17.7864 16.5779 18.4717C15.8924 19.1572 15.0684 19.4999 14.1059 19.4999ZM2.45215 15.9999C2.45215 14.3948 2.75915 12.8855 3.37315 11.4722C3.98732 10.0587 4.82165 8.82469 5.87615 7.77019C6.93065 6.71569 8.16557 5.88136 9.5809 5.26719C10.9962 4.65319 12.5046 4.34619 14.1059 4.34619V5.84619C12.7201 5.84619 11.4092 6.11269 10.1734 6.64569C8.93756 7.17886 7.85832 7.90653 6.93565 8.82869C6.01315 9.75103 5.28523 10.8257 4.7519 12.0527C4.21873 13.2795 3.95215 14.5953 3.95215 15.9999H2.45215ZM6.52915 15.9999C6.52915 14.9576 6.7304 13.9748 7.1329 13.0514C7.5354 12.1281 8.07998 11.3232 8.76665 10.6367C9.45332 9.95002 10.2544 9.40944 11.1699 9.01494C12.0854 8.62027 13.0641 8.42294 14.1059 8.42294V9.92294C12.4201 9.92294 10.9858 10.5138 9.80315 11.6954C8.62031 12.8771 8.0289 14.3119 8.0289 15.9999H6.52915Z" fill="#202127"/>
</svg>',
                'Релаксация и велнес' => '
<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M6.8 20C6.3 20 5.875 19.825 5.525 19.475C5.175 19.125 5 18.7 5 18.2C5 17.85 5.1 17.5208 5.3 17.2125C5.5 16.9042 5.76667 16.6833 6.1 16.55L10 15V12.75C9.1 13.8 8.05417 14.6042 6.8625 15.1625C5.67083 15.7208 4.38333 16 3 16V14C4.13333 14 5.1625 13.7667 6.0875 13.3C7.0125 12.8333 7.85 12.1667 8.6 11.3L9.95 9.7C10.15 9.46667 10.3833 9.29167 10.65 9.175C10.9167 9.05833 11.2 9 11.5 9H12.5C12.8 9 13.0833 9.05833 13.35 9.175C13.6167 9.29167 13.85 9.46667 14.05 9.7L15.4 11.3C16.15 12.1667 16.9875 12.8333 17.9125 13.3C18.8375 13.7667 19.8667 14 21 14V16C19.6167 16 18.3292 15.7208 17.1375 15.1625C15.9458 14.6042 14.9 13.8 14 12.75V15L17.9 16.55C18.2333 16.6833 18.5 16.9042 18.7 17.2125C18.9 17.5208 19 17.85 19 18.2C19 18.7 18.825 19.125 18.475 19.475C18.125 19.825 17.7 20 17.2 20H10V19.5C10 19.0667 10.1417 18.7083 10.425 18.425C10.7083 18.1417 11.0667 18 11.5 18H14.5C14.65 18 14.7708 17.9542 14.8625 17.8625C14.9542 17.7708 15 17.65 15 17.5C15 17.35 14.9542 17.2292 14.8625 17.1375C14.7708 17.0458 14.65 17 14.5 17H11.5C10.8 17 10.2083 17.2417 9.725 17.725C9.24167 18.2083 9 18.8 9 19.5V20H6.8ZM12 8C11.45 8 10.9792 7.80417 10.5875 7.4125C10.1958 7.02083 10 6.55 10 6C10 5.45 10.1958 4.97917 10.5875 4.5875C10.9792 4.19583 11.45 4 12 4C12.55 4 13.0208 4.19583 13.4125 4.5875C13.8042 4.97917 14 5.45 14 6C14 6.55 13.8042 7.02083 13.4125 7.4125C13.0208 7.80417 12.55 8 12 8Z" fill="#202127"/>
</svg>',
                'Бизнес и профессии' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M4 21C3.45 21 2.97917 20.8042 2.5875 20.4125C2.19583 20.0208 2 19.55 2 19V8C2 7.45 2.19583 6.97917 2.5875 6.5875C2.97917 6.19583 3.45 6 4 6H8V4C8 3.45 8.19583 2.97917 8.5875 2.5875C8.97917 2.19583 9.45 2 10 2H14C14.55 2 15.0208 2.19583 15.4125 2.5875C15.8042 2.97917 16 3.45 16 4V6H20C20.55 6 21.0208 6.19583 21.4125 6.5875C21.8042 6.97917 22 7.45 22 8V19C22 19.55 21.8042 20.0208 21.4125 20.4125C21.0208 20.8042 20.55 21 20 21H4ZM10 6H14V4H10V6ZM20 15H15V17H9V15H4V19H20V15ZM11 15H13V13H11V15ZM4 13H9V11H15V13H20V8H4V13Z" fill="#202127"/>
</svg>',
                'Наука и образование' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M12 3L1 9L5 11.18V17.18L12 21L19 17.18V11.18L21 10.09V17H23V9L12 3ZM18.82 9L12 12.72L5.18 9L12 5.28L18.82 9ZM17 15.99L12 18.72L7 15.99V12.27L12 15L17 12.27V15.99Z" fill="#202127"/>
</svg>',
                default => null,
            };

            $categoryId = DB::table('categories')->insertGetId([
                'name' => $categoryName,
                'slug' => Str::slug($categoryName),
                'description' => $categoryName,
                // Вы можете заменить 'categories/default.png' на более подходящие изображения позже
                'image' => 'categories/default.png',
                'icon_svg' => $iconSvg,
                'seo_title' => $categoryName,
                'seo_description' => $categoryName,
                'created_at' => now(),
                'updated_at' => now(),
            ]);

            foreach ($subcategories as $sub) {
                DB::table('sub_categories')->insert([
                    'name' => $sub['name'],
                    'slug' => Str::slug($sub['name']),
                    'description' => $sub['description'],
                    // Вы можете заменить 'subcategories/default.png' на более подходящие изображения позже
                    'image' => 'subcategories/default.png',
                    'seo_title' => $sub['name'],
                    'seo_description' => $sub['description'],
                    'category_id' => $categoryId,
                    'created_at' => now(),
                    'updated_at' => now(),
                ]);
            }
        }
    }
}
